Keule/ESP32_AGO_GNSS/ag-steer/steer-controller/src/hal_esp32/hal_impl.cpp
/**
 * @file hal_impl.cpp
 * @brief ESP32 HAL implementation for LilyGO T-ETH-Lite (ESP32 + ESP32-S3).
 *
 * Hardware:
 *   - MCU: ESP32 or ESP32-S3 (selected by build target)
 *   - Ethernet: W5500 via ESP-IDF ETH driver
 *   - Sensor SPI host/pins: selected in hardware_pins.h per SoC target
 *   - IMU/ADS1118/actuator chip-select and sideband pins: selected per SoC
 *   - SD card pins (OTA): selected per SoC
 *   - Safety input: active LOW
 *
 * ADS1118 ADC uses the libdriver/ads1118 library (lib/ads1118/).
 * Interface functions (SPI transmit, init, deinit, delay, debug) are
 * implemented inline in this file to access the shared sensorSPI bus.
 *
 * W5500 Ethernet uses the ESP-IDF ETH driver:
 *   - Arduino ESP32 Core >= 3.0.0: native <ETH.h>
 *   - Arduino ESP32 Core <  3.0.0: LilyGO ETHClass2 library
 * NOT the Arduino Ethernet/Ethernet3 library.
 *
 * This file includes Arduino/ESP32 headers - it must NEVER be included
 * from PC simulation code.
 */

#include "hal_impl.h"
#include "hal/hal.h"
#include "hardware_pins.h"
#include "logic/pgn_types.h"
#include "logic/log_config.h"

#define LOG_LOCAL_LEVEL LOG_LEVEL_HAL
#include "esp_log.h"

// ===================================================================
// Arduino / ESP32 includes
// ===================================================================
#include <Arduino.h>
#include <SPI.h>           // SPIClass for SoC-specific sensor bus host
#include <WiFi.h>
#include <WiFiUdp.h>
#include <Preferences.h>    // NVS flash storage for calibration
#include "driver_ads1118.h"  // libdriver ADS1118
#include <cstring>

// ===================================================================
// ETH driver selection based on Arduino ESP32 Core version
// ===================================================================
// Arduino ESP32 Core >= 3.0.0:  use native ETH (from <ETH.h>)
// Arduino ESP32 Core <  3.0.0:  use LilyGO ETHClass2 (lib/ETHClass2/)
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    #include <ETH.h>
    // Native ETH provides ETH global instance
#else
    #include "ETHClass2.h"
    // LilyGO ETHClass2 provides ETH2 global instance
    #define ETH ETH2
#endif

// ===================================================================
// W5500 Ethernet - ESP-IDF ETH driver (SPI3_HOST)
// ===================================================================

// UDP sockets for AgIO communication
// Reference uses separate sockets: one for receiving (port 8888),
// one for sending (from port 5126 to AgIO port 9999).
static WiFiUDP ethUDP_recv;  // Listen socket – bound to port 8888 (receives from AgIO)
static WiFiUDP ethUDP_send;  // Send socket – sends FROM port 5126 TO AgIO port 9999

// Static IP configuration
static IPAddress s_local_ip(192, 168, 1, 70);
static IPAddress s_subnet(255, 255, 255, 0);
static IPAddress s_gateway(192, 168, 1, 1);
static IPAddress s_dns(8, 8, 8, 8);
static IPAddress s_dest_ip(192, 168, 1, 255);

// Ethernet state tracking
static bool s_w5500_detected = false;   // true if ETH.begin() succeeded
static bool s_eth_link_up    = false;   // true if ARDUINO_EVENT_ETH_CONNECTED
static bool s_eth_has_ip     = false;   // true if ARDUINO_EVENT_ETH_GOT_IP

// ===================================================================
// Shared SPI bus used by ADS1118, IMU and actuator.
// Host/pins are selected in hardware_pins.h by target SoC.
//
// SD card OTA temporarily reuses an SPI peripheral; sensor bus is explicitly
// deinit/reinit around OTA to keep the sensor path consistent.
// ===================================================================
#if defined(LILYGO_T_ETH_LITE_ESP32S3)
static constexpr const char* k_board_target_label = "LILYGO_T_ETH_LITE_ESP32S3";
#elif defined(LILYGO_T_ETH_LITE_ESP32)
static constexpr const char* k_board_target_label = "LILYGO_T_ETH_LITE_ESP32";
#else
  #error "Unsupported LilyGO target in hal_impl.cpp"
#endif

static SPIClass sensorSPI(SENS_SPI_HOST);

// ===================================================================
// Shared sensor SPI transaction layer (bus lock + per-device settings)
// ===================================================================
enum class SpiClient : uint8_t {
    ADS1118 = 0,
    BNO085 = 1,
    ACTUATOR = 2,
    NONE = 0xFF,
};

struct SpiClientConfig {
    int cs_pin;
    uint32_t freq_hz;
    uint8_t mode;
    uint32_t period_us;   // polling interval target
};

static const SpiClientConfig k_spi_cfg_ads = {CS_STEER_ANG, 2000000, SPI_MODE1, 10000};  // 100 Hz
static SpiClientConfig k_spi_cfg_imu = {CS_IMU,       1000000, SPI_MODE3,  5000};  // 200 Hz
static const SpiClientConfig k_spi_cfg_act = {CS_ACT,       1000000, SPI_MODE0,     0};  // event-driven

static SemaphoreHandle_t s_spi_bus_mutex = nullptr;

struct SpiPollState {
    uint32_t next_due_us = 0;
    uint32_t deadline_miss = 0;
    uint32_t transactions = 0;
    uint32_t last_us = 0;
    uint32_t max_us = 0;
};

struct SpiBusTelemetry {
    uint32_t window_start_us = 0;
    uint32_t busy_us = 0;
    uint32_t transactions = 0;
};

static SpiPollState s_poll_imu;
static SpiPollState s_poll_was;
static SpiPollState s_poll_act;
static SpiBusTelemetry s_bus_tm;
static SpiClient s_last_spi_client = SpiClient::NONE;
static uint32_t s_last_spi_end_us = 0;
static SpiClient s_last_sensor_spi_client = SpiClient::NONE;
static uint32_t s_last_sensor_spi_end_us = 0;
static uint32_t s_client_switches = 0;
static uint32_t s_was_to_imu_switches = 0;
static uint32_t s_imu_to_was_switches = 0;
static uint32_t s_other_switches = 0;
static uint32_t s_was_to_imu_gap_last_us = 0;
static uint32_t s_was_to_imu_gap_max_us = 0;
static uint32_t s_imu_to_was_gap_last_us = 0;
static uint32_t s_imu_to_was_gap_max_us = 0;
static uint32_t s_sensor_was_to_imu_switches = 0;
static uint32_t s_sensor_imu_to_was_switches = 0;
static uint32_t s_sensor_was_to_imu_gap_last_us = 0;
static uint32_t s_sensor_was_to_imu_gap_max_us = 0;
static uint32_t s_sensor_imu_to_was_gap_last_us = 0;
static uint32_t s_sensor_imu_to_was_gap_max_us = 0;

static int16_t s_was_raw_cache = 0;
static uint32_t s_was_last_poll_us = 0;
static bool s_was_cache_valid = false;

static const SpiClientConfig& spiCfg(SpiClient client) {
    switch (client) {
    case SpiClient::ADS1118: return k_spi_cfg_ads;
    case SpiClient::BNO085: return k_spi_cfg_imu;
    case SpiClient::ACTUATOR: return k_spi_cfg_act;
    case SpiClient::NONE: break;
    }
    return k_spi_cfg_ads;
}

static void spiBeginCritical(void) {
    if (s_spi_bus_mutex) {
        xSemaphoreTake(s_spi_bus_mutex, portMAX_DELAY);
    }
}

static void spiEndCritical(void) {
    if (s_spi_bus_mutex) {
        xSemaphoreGive(s_spi_bus_mutex);
    }
}

static SpiPollState& spiPollForClient(SpiClient client) {
    switch (client) {
    case SpiClient::ADS1118: return s_poll_was;
    case SpiClient::BNO085: return s_poll_imu;
    case SpiClient::ACTUATOR: return s_poll_act;
    case SpiClient::NONE: break;
    }
    return s_poll_was;
}

static void updateLastMax(uint32_t& last_us, uint32_t& max_us, uint32_t value_us) {
    last_us = value_us;
    if (value_us > max_us) {
        max_us = value_us;
    }
}

