Keule/ESP32_AGO_GNSS/ag-steer/steer-controller/src/hal_esp32/hal_impl.cpp
static void spiRecordTiming(SpiClient client, uint32_t request_us, uint32_t lock_us, uint32_t end_us) {
    const uint32_t dt_us = end_us - request_us;
    SpiPollState& poll = spiPollForClient(client);
    poll.transactions++;
    poll.last_us = dt_us;
    if (dt_us > poll.max_us) {
        poll.max_us = dt_us;
    }

    s_bus_tm.busy_us += dt_us;
    s_bus_tm.transactions++;

    if (s_last_spi_client != SpiClient::NONE && s_last_spi_client != client) {
        s_client_switches++;
        const uint32_t switch_gap_us = s_last_spi_end_us == 0 ? 0 : (lock_us - s_last_spi_end_us);
        if (s_last_spi_client == SpiClient::ADS1118 && client == SpiClient::BNO085) {
            s_was_to_imu_switches++;
            updateLastMax(s_was_to_imu_gap_last_us, s_was_to_imu_gap_max_us, switch_gap_us);
        } else if (s_last_spi_client == SpiClient::BNO085 && client == SpiClient::ADS1118) {
            s_imu_to_was_switches++;
            updateLastMax(s_imu_to_was_gap_last_us, s_imu_to_was_gap_max_us, switch_gap_us);
        } else {
            s_other_switches++;
        }
    }
    s_last_spi_client = client;
    s_last_spi_end_us = end_us;

    if (client == SpiClient::ADS1118 || client == SpiClient::BNO085) {
        if (s_last_sensor_spi_client != SpiClient::NONE && s_last_sensor_spi_client != client) {
            const uint32_t sensor_gap_us = s_last_sensor_spi_end_us == 0 ? 0 : (lock_us - s_last_sensor_spi_end_us);
            if (s_last_sensor_spi_client == SpiClient::ADS1118 && client == SpiClient::BNO085) {
                s_sensor_was_to_imu_switches++;
                updateLastMax(s_sensor_was_to_imu_gap_last_us, s_sensor_was_to_imu_gap_max_us, sensor_gap_us);
            } else if (s_last_sensor_spi_client == SpiClient::BNO085 && client == SpiClient::ADS1118) {
                s_sensor_imu_to_was_switches++;
                updateLastMax(s_sensor_imu_to_was_gap_last_us, s_sensor_imu_to_was_gap_max_us, sensor_gap_us);
            }
        }
        s_last_sensor_spi_client = client;
        s_last_sensor_spi_end_us = end_us;
    }
}

static bool spiTransfer(SpiClient client, const uint8_t* tx, uint8_t* rx, size_t len) {
    const SpiClientConfig& cfg = spiCfg(client);
    if (len == 0) return true;

    const uint32_t request_us = micros();
    spiBeginCritical();
    const uint32_t lock_us = micros();

    digitalWrite(CS_STEER_ANG, HIGH);
    digitalWrite(CS_IMU, HIGH);
    digitalWrite(CS_ACT, HIGH);

    sensorSPI.beginTransaction(SPISettings(cfg.freq_hz, MSBFIRST, cfg.mode));
    digitalWrite(cfg.cs_pin, LOW);
    for (size_t i = 0; i < len; i++) {
        const uint8_t v = sensorSPI.transfer(tx ? tx[i] : 0xFF);
        if (rx) rx[i] = v;
    }
    digitalWrite(cfg.cs_pin, HIGH);
    sensorSPI.endTransaction();

    spiEndCritical();
    const uint32_t end_us = micros();
    spiRecordTiming(client, request_us, lock_us, end_us);
    return true;
}

static void spiCheckDeadline(SpiPollState* poll, uint32_t period_us, uint32_t now_us) {
    if (!poll || period_us == 0) return;
    if (poll->next_due_us == 0) {
        poll->next_due_us = now_us + period_us;
        return;
    }
    if (now_us > poll->next_due_us + period_us) {
        poll->deadline_miss++;
    }
    while (poll->next_due_us <= now_us) {
        poll->next_due_us += period_us;
    }
}

void hal_esp32_imu_spi_check_deadline(uint32_t period_us, uint32_t now_us) {
    spiCheckDeadline(&s_poll_imu, period_us, now_us);
}

bool hal_esp32_imu_raw_transfer(const uint8_t* tx, uint8_t* rx, size_t len) {
    return spiTransfer(SpiClient::BNO085, tx, rx, len);
}

uint32_t hal_esp32_sensor_spi_timing_now_us(void) {
    return micros();
}

void hal_esp32_sensor_spi_lock(void) {
    spiBeginCritical();
}

void hal_esp32_sensor_spi_unlock(void) {
    spiEndCritical();
}

void hal_esp32_sensor_spi_record_imu_transfer(uint32_t request_us, uint32_t lock_us, uint32_t end_us) {
    spiRecordTiming(SpiClient::BNO085, request_us, lock_us, end_us);
}

SPIClass& hal_esp32_sensor_spi_port(void) {
    return sensorSPI;
}

void hal_imu_on_sensor_spi_reinit(void);

// ===================================================================
// Mutex (FreeRTOS recursive mutex) — for NavigationState protection
// ===================================================================
#if configSUPPORT_STATIC_ALLOCATION
static StaticSemaphore_t s_mutex_buffer;
static SemaphoreHandle_t s_mutex = nullptr;
#else
static SemaphoreHandle_t s_mutex = nullptr;
#endif

// ===================================================================
// Serial log mutex — protects USB CDC Serial from concurrent access.
// Serial output is NOT thread-safe and can crash
// if two tasks call Serial.printf() simultaneously on different cores.
// ===================================================================
static SemaphoreHandle_t s_log_mutex = nullptr;

// ===================================================================
// Timing
// ===================================================================
uint32_t hal_millis(void) {
    return ::millis();
}

uint32_t hal_micros(void) {
    return ::micros();
}

void hal_delay_ms(uint32_t ms) {
    ::delay(ms);
}

// ===================================================================
// Logging – prints to Serial via Serial.printf.
//
// ESP_LOGI goes to UART0 by default, which does NOT appear on
// active Serial transport (USB CDC or UART, depending on target).
//
// hal_log() is kept for ABI compatibility with logic/ modules.
// New code should use LOGI/LOGD/LOGW/LOGE from log_ext.h directly.
// ===================================================================
void hal_log(const char* fmt, ...) {
    char buf[256];
    va_list args;
    va_start(args, fmt);
    std::vsnprintf(buf, sizeof(buf), fmt, args);
    va_end(args);

    char category[20] = "LOG";
    char detail[20] = "";
    const char* body = buf;
    const char* colon = std::strchr(buf, ':');
    if (colon && colon != buf && (colon - buf) < 28) {
        bool tag_ok = true;
        for (const char* p = buf; p < colon; ++p) {
            const char c = *p;
            const bool alpha = (c >= 'A' && c <= 'Z') || (c >= 'a' && c <= 'z');
            const bool digit = (c >= '0' && c <= '9');
            if (!alpha && !digit && c != '_' && c != '-') {
                tag_ok = false;
                break;
            }
        }

        if (tag_ok) {
            const char* dash = nullptr;
            for (const char* p = buf; p < colon; ++p) {
                if (*p == '-') {
                    dash = p;
                    break;
                }
            }

            const char* category_end = dash ? dash : colon;
            size_t category_len = static_cast<size_t>(category_end - buf);
            if (category_len >= sizeof(category)) category_len = sizeof(category) - 1;
            for (size_t i = 0; i < category_len; ++i) {
                const char c = buf[i];
                category[i] = (c >= 'a' && c <= 'z') ? static_cast<char>(c - 'a' + 'A') : c;
            }
            category[category_len] = '\0';

            if (dash && dash + 1 < colon) {
                size_t detail_len = static_cast<size_t>(colon - dash - 1);
                if (detail_len >= sizeof(detail)) detail_len = sizeof(detail) - 1;
                for (size_t i = 0; i < detail_len; ++i) {
                    const char c = dash[1 + i];
                    detail[i] = (c >= 'a' && c <= 'z') ? static_cast<char>(c - 'a' + 'A') : c;
                }
                detail[detail_len] = '\0';
            }

            body = colon + 1;
            while (*body == ' ') {
                body++;
            }
        }
    }

    // Protect Serial (USB CDC) from concurrent access across cores.
    if (s_log_mutex) {
        xSemaphoreTake(s_log_mutex, portMAX_DELAY);
    }
    if (detail[0] != '\0') {
        Serial.printf("[%s] [%10lu] %s: %s\n", category, millis(), detail, body);
    } else {
        Serial.printf("[%s] [%10lu] %s\n", category, millis(), body);
    }
    if (s_log_mutex) {
        xSemaphoreGive(s_log_mutex);
    }
}

// ===================================================================
// Mutex
// ===================================================================
void hal_mutex_init(void) {
    // State mutex (recursive, for NavigationState)
#if configSUPPORT_STATIC_ALLOCATION
    s_mutex = xSemaphoreCreateRecursiveMutexStatic(&s_mutex_buffer);
#else
    s_mutex = xSemaphoreCreateRecursiveMutex();
#endif

    // Serial log mutex (binary, protects USB CDC from concurrent access)
    s_log_mutex = xSemaphoreCreateMutex();
}

void hal_mutex_lock(void) {
    if (s_mutex) {
        xSemaphoreTakeRecursive(s_mutex, portMAX_DELAY);
    }
}

void hal_mutex_unlock(void) {
    if (s_mutex) {
        xSemaphoreGiveRecursive(s_mutex);
    }
}

// ===================================================================
// Safety input
// ===================================================================
bool hal_safety_ok(void) {
    // SAFETY_IN is active LOW: LOW = KICK, HIGH = OK
    return digitalRead(SAFETY_IN) == HIGH;
}

// ===================================================================
// SPI Sensors / Actuator - SPI Bus 2 (FSPI / SPI2_HOST)
// ===================================================================
void hal_sensor_spi_init(void) {
    sensorSPI.begin(SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI, -1);
    if (!s_spi_bus_mutex) {
        s_spi_bus_mutex = xSemaphoreCreateMutex();
    }
    s_bus_tm.window_start_us = micros();
    s_bus_tm.busy_us = 0;
    s_bus_tm.transactions = 0;
    s_poll_imu = {};
    s_poll_was = {};
    s_poll_act = {};
    s_last_spi_client = SpiClient::NONE;
    s_last_spi_end_us = 0;
    s_last_sensor_spi_client = SpiClient::NONE;
    s_last_sensor_spi_end_us = 0;
    s_client_switches = 0;
    s_was_to_imu_switches = 0;
    s_imu_to_was_switches = 0;
    s_other_switches = 0;
    s_was_to_imu_gap_last_us = 0;
    s_was_to_imu_gap_max_us = 0;
    s_imu_to_was_gap_last_us = 0;
    s_imu_to_was_gap_max_us = 0;
    s_sensor_was_to_imu_switches = 0;
    s_sensor_imu_to_was_switches = 0;
    s_sensor_was_to_imu_gap_last_us = 0;
    s_sensor_was_to_imu_gap_max_us = 0;
    s_sensor_imu_to_was_gap_last_us = 0;
    s_sensor_imu_to_was_gap_max_us = 0;
    s_was_cache_valid = false;
    hal_log("ESP32: sensor SPI initialised on %s (SCK=%d MISO=%d MOSI=%d)", SENS_SPI_HOST_LABEL,
            SENS_SPI_SCK, SENS_SPI_MISO, SENS_SPI_MOSI);
}

