Keule/ESP32_AGO_GNSS/ag-steer/steer-controller/src/hal_esp32/hal_impl.cpp
/// Read multiple raw samples and return the median value.
/// More robust than average against outliers.
/// @param samples  number of samples to read (should be odd for true median)
/// @param delay_ms delay between samples in ms (default: 5ms for 250 SPS)
static int16_t ads1118_read_raw_median(int samples, int sample_delay_ms = 5) {
    // Buffer for samples (max 31, enough for median)
    int16_t buf[31];
    if (samples > 31) samples = 31;
    if (samples < 1) samples = 1;

    for (int i = 0; i < samples; i++) {
        buf[i] = ads1118_read_raw();
        if (sample_delay_ms > 0) delay(sample_delay_ms);
    }

    // Simple bubble sort for small array
    for (int i = 0; i < samples - 1; i++) {
        for (int j = i + 1; j < samples; j++) {
            if (buf[j] < buf[i]) {
                int16_t tmp = buf[i];
                buf[i] = buf[j];
                buf[j] = tmp;
            }
        }
    }

    return buf[samples / 2];  // median
}

// --- Calibration persistence (NVS) ---

/// Load calibration from NVS flash.
/// Returns true if valid calibration was loaded.
static bool steer_cal_load(void) {
    Preferences prefs;
    if (!prefs.begin(NVS_NAMESPACE, true)) {  // read-only mode
        hal_log("SteerCal: NVS open failed");
        return false;
    }

    uint32_t magic = prefs.getUInt(NVS_KEY_CAL_VALID, 0);
    if (magic != NVS_CAL_MAGIC) {
        prefs.end();
        hal_log("SteerCal: no valid calibration in NVS");
        return false;
    }

    s_cal_left_raw  = static_cast<int16_t>(prefs.getInt(NVS_KEY_CAL_LEFT, 0));
    s_cal_right_raw = static_cast<int16_t>(prefs.getInt(NVS_KEY_CAL_RIGHT, 0));
    s_calibrated = true;

    prefs.end();

    hal_log("SteerCal: loaded from NVS (left=%d, right=%d)",
            s_cal_left_raw, s_cal_right_raw);
    return true;
}

/// Save calibration to NVS flash.
static void steer_cal_save(void) {
    Preferences prefs;
    if (!prefs.begin(NVS_NAMESPACE, false)) {  // read-write mode
        hal_log("SteerCal: NVS open failed, cannot save!");
        return;
    }

    prefs.putUInt(NVS_KEY_CAL_VALID, NVS_CAL_MAGIC);
    prefs.putInt(NVS_KEY_CAL_LEFT, static_cast<int32_t>(s_cal_left_raw));
    prefs.putInt(NVS_KEY_CAL_RIGHT, static_cast<int32_t>(s_cal_right_raw));

    prefs.end();

    hal_log("SteerCal: saved to NVS (left=%d, right=%d)",
            s_cal_left_raw, s_cal_right_raw);
}

/// Wait for user to press Enter on Serial monitor.
/// While waiting, shows live ADC voltage at 20 Hz (every 50ms).
static void wait_for_enter_live_adc(void) {
    uint32_t last_print = 0;
    while (true) {
        // Check for Enter key
        if (Serial.available()) {
            int c = Serial.read();
            if (c == '\n' || c == '\r') {
                while (Serial.available()) Serial.read();
                // Print one final value + newline to cleanly end the live line
                int16_t raw = ads1118_read_raw();
                float voltage = raw * 4.096f / 32768.0f;
                Serial.printf("   -> %7.3f V  (raw=%d)\n", voltage, raw);
                delay(50);
                return;
            }
        }
        // Print live ADC value every 50ms using \r to overwrite line
        uint32_t now = millis();
        if (now - last_print >= 50) {
            last_print = now;
            int16_t raw = ads1118_read_raw();
            float voltage = raw * 4.096f / 32768.0f;
            Serial.printf("   -> %7.3f V  (raw=%d)  \r", voltage, raw);
        }
        delay(2);
    }
}

void hal_steer_angle_begin(void) {
    // Ensure all other SPI device CS pins are configured as outputs
    pinMode(CS_IMU, OUTPUT);  digitalWrite(CS_IMU, HIGH);
    pinMode(CS_ACT, OUTPUT);  digitalWrite(CS_ACT, HIGH);

    // Wire up libdriver handle with ESP32 interface functions
    DRIVER_ADS1118_LINK_INIT(&s_ads1118_handle, ads1118_handle_t);
    DRIVER_ADS1118_LINK_SPI_INIT(&s_ads1118_handle, ads1118_if_spi_init);
    DRIVER_ADS1118_LINK_SPI_DEINIT(&s_ads1118_handle, ads1118_if_spi_deinit);
    DRIVER_ADS1118_LINK_SPI_TRANSMIT(&s_ads1118_handle, ads1118_if_spi_transmit);
    DRIVER_ADS1118_LINK_DELAY_MS(&s_ads1118_handle, ads1118_if_delay_ms);
    DRIVER_ADS1118_LINK_DEBUG_PRINT(&s_ads1118_handle, ads1118_if_debug_print);

    // Initialise driver
    uint8_t res = ads1118_init(&s_ads1118_handle);
    if (res != 0) {
        hal_log("ESP32: ADS1118 init failed (err=%u)", res);
        return;
    }

    // Configure: AIN0 single-ended, +/-4.096V, 250 SPS, ADC mode
    ads1118_set_channel(&s_ads1118_handle, ADS1118_CHANNEL_AIN0_GND);
    ads1118_set_range(&s_ads1118_handle, ADS1118_RANGE_4P096V);
    ads1118_set_rate(&s_ads1118_handle, ADS1118_RATE_250SPS);
    ads1118_set_mode(&s_ads1118_handle, ADS1118_MODE_ADC);

    // Try to load calibration from NVS
    steer_cal_load();

    hal_log("ESP32: ADS1118 configured (AIN0, +/-4.096V, 250 SPS, calibrated=%s)",
            s_calibrated ? "YES" : "NO");
}

bool hal_steer_angle_detect(void) {
    // Detection: try a direct raw read. If the value is not stuck at
    // 0x0000 or 0xFFFF (floating MISO), the ADS1118 is present.
    // Also discard 0x7FFF (all 1s in data, possible bus issue).
    //
    // After the OTA SD card check, the FSPI bus was deinitialised and
    // reinitialised by sd_ota_esp32.cpp.  The ADS1118 may need time to
    // recover, or the bus may not be fully functional yet.
    // Strategy: try up to 3 times with increasing delays.

    int16_t raw1 = 0;
    int16_t raw2 = 0;
    bool looks_valid = false;

    for (int attempt = 0; attempt < 3 && !looks_valid; attempt++) {
        if (attempt > 0) {
            hal_log("ESP32: ADS1118 detect retry %d/2...", attempt);
            delay(100);  // give ADS1118 and SPI bus more time
        }

        raw1 = ads1118_read_raw();
        delay(20);
        raw2 = ads1118_read_raw();

        looks_valid = (raw1 != 0 && raw1 != -1 && raw1 != 0x7FFF &&
                       raw2 != 0 && raw2 != -1 && raw2 != 0x7FFF);
    }

    // If still failing, try a full ADS1118 re-init (write config register)
    if (!looks_valid) {
        hal_log("ESP32: ADS1118 still 0x%04X after retries, re-initialising chip...", raw1);
        // Re-init: set CS pin, write config word to start continuous conversion
        // The ADS1118 config word: 0001 MUX PGA RATE MODE TS Reserved
        // MUX=100 (AIN0-GND), PGA=001 (4.096V), RATE=101 (250SPS), MODE=0 (continuous)
        uint8_t tx[4] = {0x84, 0xC3, 0xFF, 0xFF};  // config + 2 dummy bytes for data
        uint8_t rx[4];
        ads1118_if_spi_transmit(tx, rx, 4);
        delay(50);  // wait for first conversion at 250 SPS = 4ms, use 50ms margin

        raw1 = ads1118_read_raw();
        delay(20);
        raw2 = ads1118_read_raw();
        looks_valid = (raw1 != 0 && raw1 != -1 && raw1 != 0x7FFF &&
                       raw2 != 0 && raw2 != -1 && raw2 != 0x7FFF);
        hal_log("ESP32: ADS1118 after re-init: raw1=%d (0x%04X) raw2=%d (0x%04X) %s",
                raw1, (unsigned)raw1 & 0xFFFF, raw2, (unsigned)raw2 & 0xFFFF,
                looks_valid ? "OK" : "STILL FAIL");
    }

